import { INews } from '@/shared/interface/news';
import { Group } from '@/shared/interface/section';

export const GroupItems: Group[] = [
    {
        id: 0,
        name: 'Группа ИК-114',
        teacher: 'Иванов Иван Иванович',
        time: '14:30',
        total_students: '16',
        max_students: '18',
    },
    {
        id: 1,
        name: 'Группа ИК-114',
        teacher: 'Иванов Иван Иванович',
        time: '14:30',
        total_students: '16',
        max_students: '18',
    },
];

export const NewsItems: INews[] = [
    {
        id: 0,
        time: '15.45',
        data: '12.11.23',
        user: {
            id: 0,
            email: 'dima@mail.ru',
            firstname: 'Дмитрий',
            surname: 'Степанов',
            surdname: 'Андреевич',
        },
        message:
            'ВАЖНО! В связи с техническим сбоем состязание отборочного этапа олимпиады «Высшая проба» по иностранным языкам, запланированное ранее на 11 ноября 2023 года, перенесено на 26 ноября 2023 года.',
    },
    {
        id: 1,
        time: '15.45',
        data: '12.11.23',
        user: {
            id: 0,
            email: 'dima@mail.ru',
            firstname: 'Дмитрий',
            surname: 'Степанов',
            surdname: 'Андреевич',
        },
        message:
            'ВАЖНО! В связи с техническим сбоем состязание отборочного этапа олимпиады «Высшая проба» по иностранным языкам, запланированное ранее на 11 ноября 2023 года, перенесено на 26 ноября 2023 года.',
    },
    {
        id: 2,
        time: '15.45',
        data: '12.11.23',
        user: {
            id: 0,
            email: 'dima@mail.ru',
            firstname: 'Дмитрий',
            surname: 'Степанов',
            surdname: 'Андреевич',
        },
        message:
            'ВАЖНО! В связи с техническим сбоем состязание отборочного этапа олимпиады «Высшая проба» по иностранным языкам, запланированное ранее на 11 ноября 2023 года, перенесено на 26 ноября 2023 года.',
    },
    {
        id: 3,
        time: '15.45',
        data: '12.11.23',
        user: {
            id: 0,
            email: 'dima@mail.ru',
            firstname: 'Дмитрий',
            surname: 'Степанов',
            surdname: 'Андреевич',
        },
        message:
            'ВАЖНО! В связи с техническим сбоем состязание отборочного этапа олимпиады «Высшая проба» по иностранным языкам, запланированное ранее на 11 ноября 2023 года, перенесено на 26 ноября 2023 года.',
    },
    {
        id: 4,
        time: '15.45',
        data: '12.11.23',
        user: {
            id: 0,
            email: 'dima@mail.ru',
            firstname: 'Дмитрий',
            surname: 'Степанов',
            surdname: 'Андреевич',
        },
        message:
            'ВАЖНО! В связи с техническим сбоем состязание отборочного этапа олимпиады «Высшая проба» по иностранным языкам, запланированное ранее на 11 ноября 2023 года, перенесено на 26 ноября 2023 года.',
    },
    {
        id: 5,
        time: '15.45',
        data: '12.11.23',
        user: {
            id: 0,
            email: 'dima@mail.ru',
            firstname: 'Дмитрий',
            surname: 'Степанов',
            surdname: 'Андреевич',
        },
        message:
            'ВАЖНО! В связи с техническим сбоем состязание отборочного этапа олимпиады «Высшая проба» по иностранным языкам, запланированное ранее на 11 ноября 2023 года, перенесено на 26 ноября 2023 года.',
    },
];
